release-evidence/benchmarks/enterprise-20260811T132328Z/raw-runs/soak-final-1680-20260811T1335Z/enterprise-smoke.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /tmp/k6-consume/enterprise-realm.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 30s max duration (incl. graceful stop):
              * smoke: 5.00 iterations/s for 10s (maxVUs: 25-100, exec: enterpriseJourney, gracefulStop: 20s)


running (01.0s), 000/025 VUs, 5 complete and 0 interrupted iterations
smoke   [  10% ] 000/025 VUs  01.0s/10s  5.00 iters/s

running (02.0s), 000/025 VUs, 10 complete and 0 interrupted iterations
smoke   [  20% ] 000/025 VUs  02.0s/10s  5.00 iters/s

running (03.0s), 000/025 VUs, 15 complete and 0 interrupted iterations
smoke   [  30% ] 000/025 VUs  03.0s/10s  5.00 iters/s

running (04.0s), 000/025 VUs, 20 complete and 0 interrupted iterations
smoke   [  40% ] 000/025 VUs  04.0s/10s  5.00 iters/s

running (05.0s), 000/025 VUs, 25 complete and 0 interrupted iterations
smoke   [  50% ] 000/025 VUs  05.0s/10s  5.00 iters/s

running (06.0s), 000/025 VUs, 30 complete and 0 interrupted iterations
smoke   [  60% ] 000/025 VUs  06.0s/10s  5.00 iters/s

running (07.0s), 000/025 VUs, 35 complete and 0 interrupted iterations
smoke   [  70% ] 000/025 VUs  07.0s/10s  5.00 iters/s

running (08.0s), 000/025 VUs, 40 complete and 0 interrupted iterations
smoke   [  80% ] 000/025 VUs  08.0s/10s  5.00 iters/s

running (09.0s), 000/025 VUs, 45 complete and 0 interrupted iterations
smoke   [  90% ] 000/025 VUs  09.0s/10s  5.00 iters/s

running (10.0s), 000/025 VUs, 50 complete and 0 interrupted iterations
smoke   [ 100% ] 000/025 VUs  10.0s/10s  5.00 iters/s


  █ THRESHOLDS 

    account_duration
    ✓ 'p(95)<250' p(95)=36.34ms

    credentials_duration
    ✓ 'p(95)<250' p(95)=47.61ms

    dropped_iterations
    ✓ 'count==0' count=0

    enterprise_end_to_end_duration
    ✓ 'p(95)<300' p(95)=45.68ms
    ✓ 'p(99)<750' p(99)=81.01ms

    enterprise_request_failures
    ✓ 'rate<0.001' rate=0.00%

    enterprise_unplanned_5xx
    ✓ 'count==0' count=0

    jwks_duration
    ✓ 'p(95)<150' p(95)=25.54ms

    phase_smoke_account
    ✓ 'p(95)<250' p(95)=36.34ms

    phase_smoke_application
    ✓ 'p(95)<150' p(95)=21.68ms
    ✓ 'p(99)<400' p(99)=56.01ms

    phase_smoke_completed
    ✓ 'count>=50' count=50

    phase_smoke_credentials
    ✓ 'p(95)<250' p(95)=47.61ms

    phase_smoke_end_to_end
    ✓ 'p(95)<300' p(95)=45.68ms
    ✓ 'p(99)<750' p(99)=81.01ms

    phase_smoke_failures
    ✓ 'rate<0.001' rate=0.00%

    phase_smoke_jwks
    ✓ 'p(95)<150' p(95)=25.54ms

    phase_smoke_sabledb
    ✓ 'p(95)<150' p(95)=21.49ms
    ✓ 'p(99)<250' p(99)=55.6ms

    phase_smoke_token
    ✓ 'p(95)<350' p(95)=86.25ms

    phase_smoke_unplanned_5xx
    ✓ 'count==0' count=0

    sabledb_duration
    ✓ 'p(95)<150' p(95)=21.49ms
    ✓ 'p(99)<250' p(99)=55.6ms

    server_application_duration
    ✓ 'p(95)<150' p(95)=21.68ms
    ✓ 'p(99)<400' p(99)=56.01ms

    token_duration
    ✓ 'p(95)<350' p(95)=86.25ms


  █ TOTAL RESULTS 

    checks_total.......: 100     9.998794/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ enterprise operation returned 200
    ✓ internal timing was returned

    CUSTOM
    account_duration.................: avg=29.54ms  min=23.82ms med=29.07ms max=46.59ms  p(90)=33.66ms p(95)=36.34ms  p(99)=44.62ms  p(99.9)=46.39ms 
    application_nonstore_duration....: avg=232.11µs min=42µs    med=213.5µs max=594µs    p(90)=325.8µs p(95)=367.39µs p(99)=503.83µs p(99.9)=584.98µs
    credentials_duration.............: avg=36.95ms  min=28.58ms med=34.65ms max=48.62ms  p(90)=46.59ms p(95)=47.61ms  p(99)=48.42ms  p(99.9)=48.6ms  
    enterprise_end_to_end_duration...: avg=32.21ms  min=21.46ms med=29.61ms max=112.12ms p(90)=38.45ms p(95)=45.68ms  p(99)=81.01ms  p(99.9)=109.01ms
    enterprise_request_failures......: 0.00%  0 out of 50
    enterprise_unplanned_5xx.........: 0      0/s
    external_path_duration...........: avg=23.78ms  min=18.78ms med=23.93ms max=30.1ms   p(90)=26.8ms  p(95)=27.39ms  p(99)=29.79ms  p(99.9)=30.07ms 
    jwks_duration....................: avg=23.6ms   min=21.46ms med=23.6ms  max=25.75ms  p(90)=25.32ms p(95)=25.54ms  p(99)=25.71ms  p(99.9)=25.75ms 
    phase_smoke_account..............: avg=29.54ms  min=23.82ms med=29.07ms max=46.59ms  p(90)=33.66ms p(95)=36.34ms  p(99)=44.62ms  p(99.9)=46.39ms 
    phase_smoke_application..........: avg=8.42ms   min=42µs    med=5.7ms   max=86.31ms  p(90)=11.59ms p(95)=21.68ms  p(99)=56.01ms  p(99.9)=83.28ms 
    phase_smoke_completed............: 50     4.999397/s
    phase_smoke_credentials..........: avg=36.95ms  min=28.58ms med=34.65ms max=48.62ms  p(90)=46.59ms p(95)=47.61ms  p(99)=48.42ms  p(99.9)=48.6ms  
    phase_smoke_end_to_end...........: avg=32.21ms  min=21.46ms med=29.61ms max=112.12ms p(90)=38.45ms p(95)=45.68ms  p(99)=81.01ms  p(99.9)=109.01ms
    phase_smoke_failures.............: 0.00%  0 out of 50
    phase_smoke_jwks.................: avg=23.6ms   min=21.46ms med=23.6ms  max=25.75ms  p(90)=25.32ms p(95)=25.54ms  p(99)=25.71ms  p(99.9)=25.75ms 
    phase_smoke_sabledb..............: avg=8.19ms   min=0s      med=5.41ms  max=85.71ms  p(90)=11.27ms p(95)=21.49ms  p(99)=55.6ms   p(99.9)=82.7ms  
    phase_smoke_token................: avg=42.15ms  min=28.56ms med=31.93ms max=112.12ms p(90)=60.38ms p(95)=86.25ms  p(99)=106.95ms p(99.9)=111.61ms
    phase_smoke_transport_failures...: 0      0/s
    phase_smoke_unplanned_5xx........: 0      0/s
    sabledb_duration.................: avg=8.19ms   min=0s      med=5.41ms  max=85.71ms  p(90)=11.27ms p(95)=21.49ms  p(99)=55.6ms   p(99.9)=82.7ms  
    sabledb_round_trips..............: avg=1.92     min=0       med=2       max=2        p(90)=2       p(95)=2        p(99)=2        p(99.9)=2       
    server_application_duration......: avg=8.42ms   min=42µs    med=5.7ms   max=86.31ms  p(90)=11.59ms p(95)=21.68ms  p(99)=56.01ms  p(99.9)=83.28ms 
    token_duration...................: avg=42.15ms  min=28.56ms med=31.93ms max=112.12ms p(90)=60.38ms p(95)=86.25ms  p(99)=106.95ms p(99.9)=111.61ms

    HTTP
    http_req_duration................: avg=32.21ms  min=21.46ms med=29.61ms max=112.12ms p(90)=38.45ms p(95)=45.68ms  p(99)=81.01ms  p(99.9)=109.01ms
      { expected_response:true }.....: avg=32.21ms  min=21.46ms med=29.61ms max=112.12ms p(90)=38.45ms p(95)=45.68ms  p(99)=81.01ms  p(99.9)=109.01ms
    http_req_failed..................: 0.00%  0 out of 50
    http_reqs........................: 50     4.999397/s

    EXECUTION
    dropped_iterations...............: 0      0/s
    iteration_duration...............: avg=45.39ms  min=22.07ms med=46.67ms max=140.83ms p(90)=62.76ms p(95)=69.37ms  p(99)=111.16ms p(99.9)=137.86ms
    iterations.......................: 50     4.999397/s
    vus..............................: 0      min=0       max=0 
    vus_max..........................: 25     min=25      max=25

    NETWORK
    data_received....................: 141 kB 14 kB/s
    data_sent........................: 23 kB  2.3 kB/s



running (10.0s), 000/025 VUs, 50 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 000/025 VUs  10s  5.00 iters/s